Revit 2027 API
BuiltInFailures.GroupFailures.MoveElemFailed Property
 Unable to move element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MoveElemFailed { get; }
Public Shared ReadOnly Property MoveElemFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MoveElemFailed {
	FailureDefinitionId^ get ();
}
static member MoveElemFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace